manuales/lenguajemarcas/referencia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2020-02-04 mar 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Referencia Lenguaje de Marcas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Víctor Chico Rodríguez" />
</head>
<body>
<div id="content">
<h1 class="title">Referencia Lenguaje de Marcas</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3234d9c">1. Introducción</a></li>
<li><a href="#orgd724db6">2. HTML</a>
<ul>
<li><a href="#org0305727">2.1. Estructura de un archivo HTML</a></li>
<li><a href="#org6e3225d">2.2. Principales etiquetas</a></li>
</ul>
</li>
<li><a href="#org05f14b4">3. CSS</a></li>
<li><a href="#org4b65555">4. XML</a></li>
</ul>
</div>
</div>
<p>
<a href="./referencia.org">Descargar archivo fuente .org</a><br />
<a href="./referencia.pdf">Descargar como PDF</a><br />
<a href="./referencia.odt">Descargar como OpenDocument</a>
</p>

<div id="outline-container-org3234d9c" class="outline-2">
<h2 id="org3234d9c"><span class="section-number-2">1</span> Introducción</h2>
<div class="outline-text-2" id="text-1">
<p>
Según wikipedia, un lenguajes de marcas es una forma de codificar un documento que, junto con el texto, incorpora etiquetas o marcas que contienen información adicional acerca de la estructura del texto o su presentación.
</p>

<p>
El lenguaje de marcas más extendido es el HTML (<i>HyperText Markup Language</i>, lenguaje de marcado de hipertexto), usado principalmente para hacer páginas web.
</p>

<p>
Un lenguaje de marcas no es un lenguaje de programación ya que, por ejemplo, un lenguaje de marcas no tiene funciones aritmétias o variables, como si tienen los lenguajes de programación, se puede decir que son <i>solo</i> datos.
</p>
</div>
</div>
<div id="outline-container-orgd724db6" class="outline-2">
<h2 id="orgd724db6"><span class="section-number-2">2</span> HTML</h2>
<div class="outline-text-2" id="text-2">
<p>
HTLM es un lenguaje de marcas que sirve para dar formato y dotar de una estructura a un texto, esto se consigue mediante etiquetas y atributos, además HTML incluye ciertas etiquetas que nos permitirán enlazar código Javascript (principalmente, aunque algunos navegadores soportan otro tipo de scripts), hojas de estilo CSS (para complementar o, siguiendo los estándares actuales, suplantar las funciones de estilo de HTML, dejándolo sólo como estructura) y otras etiquetas sin contenido estructural que darán información al programa que las interprete.
</p>
</div>
<div id="outline-container-org0305727" class="outline-3">
<h3 id="org0305727"><span class="section-number-3">2.1</span> Estructura de un archivo HTML</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Antes de pasar a ver como sería una página web perfectamente funcional, veamos cómo es la estructura de una etiqueta genérica:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #8700af; font-weight: bold;">etiqueta</span> <span style="color: #af5fd7;">atributo</span>=<span style="color: #2aa198;">"valor-del-atributo"</span>&gt;Contenido de la etiqueta&lt;/<span style="color: #8700af; font-weight: bold;">etiqueta</span>&gt;
</pre>
</div>
<p>
Dentro de los símbolos de menor que (&lt;) y mayor que (&gt;), se encuentra la etiqueta propiamente dicha, en su primera aparición se abre y en su segunda se cierra (poníendo el símbolo <code>/</code>, a veces hablamos de etiquetas de apertura y de cierre en este sentido.
</p>

<p>
Dentro de la etiqueta de apertura se encuentran los atributos de la misma, se componen de un nombre y frecuentemente de un signo igual <code>=</code> y entre comillas el valor que tenga ese atributo.
</p>

<p>
Entre la etiqueta de apertura y la de cierre encontramos un texto, es el contenido de la etiqueta, que podría ser en lugar de un texto otra etiqueta o una serie de ellas.
</p>

<p>
A continuación un ejemplo de una página HTML funcional:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #2aa198;">&lt;!doctype html&gt;</span>
&lt;<span style="color: #8700af; font-weight: bold;">html</span>&gt;
  &lt;<span style="color: #8700af; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Esctructura html</span>&lt;/<span style="color: #8700af; font-weight: bold;">title</span>&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">link</span> <span style="color: #af5fd7;">rel</span>=<span style="color: #2aa198;">"stylesheet"</span> <span style="color: #af5fd7;">href</span>=<span style="color: #2aa198;">"mihojadeestilos.css"</span> <span style="color: #af5fd7;">type</span>=<span style="color: #2aa198;">"text/css"</span> /&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">script</span> <span style="color: #af5fd7;">src</span>=<span style="color: #2aa198;">"miscript.js"</span> <span style="color: #af5fd7;">type</span>=<span style="color: #2aa198;">"text/javascript"</span> /&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">meta</span> <span style="color: #af5fd7;">charset</span>=<span style="color: #2aa198;">"utf-8"</span> /&gt;
  &lt;/<span style="color: #8700af; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #8700af; font-weight: bold;">body</span>&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">T&#237;tulo de una secci&#243;n</span>&lt;/<span style="color: #8700af; font-weight: bold;">h1</span>&gt;
    &lt;<span style="color: #8700af; font-weight: bold;">p</span>&gt;Esto es un p&#225;rrafo&lt;/<span style="color: #8700af; font-weight: bold;">p</span>&gt;
  &lt;/<span style="color: #8700af; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #8700af; font-weight: bold;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e3225d" class="outline-3">
<h3 id="org6e3225d"><span class="section-number-3">2.2</span> Principales etiquetas</h3>
</div>
</div>

<div id="outline-container-org05f14b4" class="outline-2">
<h2 id="org05f14b4"><span class="section-number-2">3</span> CSS</h2>
</div>
<div id="outline-container-org4b65555" class="outline-2">
<h2 id="org4b65555"><span class="section-number-2">4</span> XML</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Víctor Chico Rodríguez</p>
<p class="date">Created: 2020-02-04 mar 12:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
